In [1]:
import pandas as pd

In [7]:
#reading  data from a csv file
df=pd.read_csv('C:\\Users\\Aakash\\Desktop\\adhoc_ML\\com.csv')

In [8]:
df.head()

            Name Department     Manager  Salary
0     Robin Hood        NaN         NaN     200
1  Arsene Wenger        Bar  Friar Tuck      50
2     Friar Tuck        Foo  Robin Hood     100
3    Little John        Foo  Robin Hood     100
4  Sam Allardyce        NaN         NaN     250

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
Name          6 non-null object
Department    4 non-null object
Manager       4 non-null object
Salary        6 non-null int64
dtypes: int64(1), object(3)
memory usage: 272.0+ bytes

In [11]:
df.head(3)

            Name Department     Manager  Salary
0     Robin Hood        NaN         NaN     200
1  Arsene Wenger        Bar  Friar Tuck      50
2     Friar Tuck        Foo  Robin Hood     100

In [13]:
#printing particular coloumn

df['Name']

0       Robin Hood
1    Arsene Wenger
2       Friar Tuck
3      Little John
4    Sam Allardyce
5    Dimi Berbatov
Name: Name, dtype: object

In [14]:
# for selecting rows and coloumns

df.iloc[0:,0]

0       Robin Hood
1    Arsene Wenger
2       Friar Tuck
3      Little John
4    Sam Allardyce
5    Dimi Berbatov
Name: Name, dtype: object

In [20]:
df.iloc[0:,0:2]

            Name Department
0     Robin Hood        NaN
1  Arsene Wenger        Bar
2     Friar Tuck        Foo
3    Little John        Foo
4  Sam Allardyce        NaN
5  Dimi Berbatov        Foo

In [22]:
df['Salary']

0    200
1     50
2    100
3    100
4    250
5     50
Name: Salary, dtype: int64

In [23]:
df['Salary'].mean()

125.0

In [27]:
df['Salary'].sum()

750

In [28]:
df.values

array([['Robin Hood', nan, nan, 200],
       ['Arsene Wenger', 'Bar', 'Friar Tuck', 50],
       ['Friar Tuck', 'Foo', 'Robin Hood', 100],
       ['Little John', 'Foo', 'Robin Hood', 100],
       ['Sam Allardyce', nan, nan, 250],
       ['Dimi Berbatov', 'Foo', 'Little John', 50]], dtype=object)